---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.StructuralFrequency
source: html/b88c45fc-405a-e23e-2f85-8b0a63c0a174.htm
---
# Autodesk.Revit.DB.SpecTypeId.StructuralFrequency Property

Frequency, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFrequency { get; }
```